Конфигурация/Documents/ВыводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ЗаявкаПайщика</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеЦенныхБумаг</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДФЛ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыпискиНДФЛ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ФормыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВыводДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ПометкаУдаления Тогда // "отказ" при обработке заполнения
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Объект.Комментарий,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииПоручения(Объект, Отказ);	
	КонецЕсли;
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПодтверждениеОперацииНаСервере();
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;		
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки = ВыбранноеЗначение;
			
			ЗаполнитьЗначенияСвойств(Объект,
				ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбранноеЗначение, "Контрагент, РасчетныйСчетКонтрагента"));

			Объект.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(													
													Объект.Организация, 
													Объект.Контрагент,											
													Объект.РасчетныйСчетКонтрагента, 
													ЭтаФорма.ТипПередачи = 1, 
													Объект.Дата);	
			
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		ИначеЕсли ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыпискиНДФЛ" Тогда
			Объект.СтрокаБанковскойВыпискиНДФЛ   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыпискиНДФЛ = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыпискиНДФЛ);			
		КонецЕсли;
		
		ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)

	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
		ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПогашениеПаев") 
		И ЗначениеЗаполнено(Объект.Основание) Тогда
		
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда 
			РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "Владелец, РасчетныйСчет");
		
			Объект.Контрагент = РеквизитыЗаявки.Владелец;
			Объект.РасчетныйСчетКонтрагента = РеквизитыЗаявки.РасчетныйСчет;  
		Иначе	
			РеквизитыПогашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "Владелец");
		
			Объект.Контрагент = РеквизитыПогашения.Владелец;
			// нет р/счета в Погашении паев

		КонецЕсли;
		
		ЗаполнитьСубконто1НаСервере();
		ЗаполнитьСуммыПоЗаявкеПайщикаНаСервере();
		
		ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
		
	КонецЕсли;
	
	УстановитьВариантыНазначенияПлатежа(Истина);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСуммыПоЗаявкеПайщикаНаСервере()
	
	// проверим есть задолженность, нужно ли считать НДФЛ и расчитан ли он?

	Данные =  Документы.ВыводДенежныхСредств.ПолучитьДанныеЗаполненияПоЗаявкеПайщика(Объект.Основание, Объект.Дата); 
	
	Если Данные = Неопределено Тогда 
		Объект.Сумма = 0;
		Объект.СуммаНДФЛ = 0;  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет задолженности перед пайщиком для вывода д/с по " + Объект.Основание);
	Иначе
		Если Данные.ОжидаетсяРасчетНДФЛ И НЕ Данные.ЕстьРасчетНДФЛ Тогда
			Объект.Сумма = Данные.Сумма;
			Объект.СуммаНДФЛ = 0;  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для заполнения суммы НДФЛ необходимо сделать Расчет НДФЛ пайщиков по " + Объект.Основание); 
		Иначе
			Объект.Сумма = Данные.Сумма;
			Объект.СуммаНДФЛ = Данные.СуммаНДФЛ;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств")
		ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг") Тогда
		Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "ПометкаУдаления") Тогда
			Если Вопрос("Пометить на удаление поручение? Документ ввода ценных бумаг будет записан и перепроведен (для проведенных)!", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				СтандартнаяОбработка = Ложь;
				ПометитьНаУдалениеПоручениеНаСервере();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	ОснованиеПриИзменении(Элемент);
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.СуммаНДФЛ = 0;
		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику") Тогда
		Объект.Основание	               = Неопределено;
		Объект.СтрокаБанковскойВыпискиНДФЛ = Неопределено;
		ОснованиеПриИзменении(Элемент);
		ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
	КонецЕсли; 
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных") Тогда
		Объект.ДокументЗачисления = Неопределено;
	КонецЕсли;	
	
	НовыйСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ВидОперации);
	
	Если НовыйСчет <> Объект.КоррСчет Тогда
		Если ЗначениеЗаполнено(Объект.КоррСчет) Тогда
			Если Вопрос("Заменить корр. счет на " + НовыйСчет + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.КоррСчет = НовыйСчет;
				КоррСчетПриИзменении(Этаформа.Элементы.КоррСчет);
			КонецЕсли;
		Иначе
			Объект.КоррСчет = НовыйСчет;
			КоррСчетПриИзменении(Этаформа.Элементы.КоррСчет);
		КонецЕсли;
	КонецЕсли; 
	
	НастроитьПараметрыОтбораОснования();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
			
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	КонецЕсли;
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);

	УстановитьТекстКонтрагентаДоговора();
	
	Объект.РасчетныйСчетКонтрагента = Неопределено;
	
	ЗаполнитьСубконто1НаСервере();
	
	НастроитьПараметрыОтбораОснования();
	
	УстановитьВариантыНазначенияПлатежа(Истина);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДенежныхСредствПриИзменении(Элемент)
	
	Если      Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная") Тогда
		Объект.Касса = Неопределено;
		
	ИначеЕсли Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная") Тогда
		Объект.РасчетныйСчет               = Неопределено;
		Объект.РасчетныйСчетКонтрагента    = Неопределено;
		Объект.СтрокаБанковскойВыписки     = Неопределено;
		Объект.СтрокаБанковскойВыпискиНДФЛ = Неопределено;
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьСубконто1НаСервере();
	ОбработатьРасчетныйСчетПриИзмененииКонтрагента();
	УстановитьТекстКонтрагентаДоговора();

КонецПроцедуры

&НаКлиенте
Процедура КоррСчетПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["Субконто" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСубконто1НаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, Контрагент, ВидДвижения, Сумма, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			Объект.Контрагент,
			ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход"),
			Объект.Сумма - Объект.СуммаНДФЛ,
			Объект.РасчетныйСчетКонтрагента),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНДФЛНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход"),
			Объект.СуммаНДФЛ),
		"СтрокаБанковскойВыпискиНДФЛ",
		ЭтаФорма,
		СтандартнаяОбработка);
		
КонецПроцедуры     
	

&НаКлиенте
Процедура СуммаНДФЛПриИзменении(Элемент)
	
	ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
			
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	УстановитьТекстКонтрагентаДоговора();

	ОбработатьРасчетныйСчетПриИзмененииКонтрагента();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаВыбратьДанныеПоКонтрагенту(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьДанныеПоКонтрагенту(Команда)
		
	СоответствиеРеквизитовИсполнителяИДокумента = Новый Структура("РасчетныйСчет", "РасчетныйСчетКонтрагента");
	
	Если ЭтаФорма.ТипПередачи = 2 Тогда
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, Объект.Контрагент, Ложь, СоответствиеРеквизитовИсполнителяИДокумента, Неопределено);	
	Иначе
		
		ЮрФизЛицоКлиента = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, ЮрФизЛицоКлиента, ЭтаФорма.ТипПередачи = 1, СоответствиеРеквизитовИсполнителяИДокумента, ?(ЭтаФорма.ТипПередачи = 1, "КонтрагентДоговорТекстом", Неопределено));
		
	КонецЕсли;
	
	Если ЭтаФорма.ТипПередачи <> 1 Тогда
		УстановитьТекстКонтрагентаДоговора();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНДФЛ(Команда)
	
	Объект.СуммаНДФЛ = РассчитатьНДФЛНаСервере(Объект.Организация, Объект.Контрагент, Объект.Дата, Объект.Ссылка);
	
	ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьНДФЛНаСервере(Знач Организация, Знач ЮрФизЛицо, Знач Дата, Знач Ссылка)
	
	Если ЮрФизЛицо.ВидЮрФизЛица <> Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Возврат 0;
	КонецЕсли;
	
	Обработка = Обработки.ПечатьРасчетаНДФЛ.Создать();
	
	Обработка.Организация = Организация;
	Обработка.ЮрФизЛицо   = ЮрФизЛицо;
	Обработка.Дата        = Дата;
	
	Возврат Обработка.РассчитатьНДФЛ();
	
КонецФункции

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСубконто1НаСервере()
			
	Объект.Субконто1 = РаботаСДокументами.Субконто1ДляВводаВыводаДенежныхСредств(Объект);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСуммуПайщику(Сумма, СуммаНДФЛ, Дата)
	
	Если РаботаСДокументамиКлиентСервер.ТребуетсяСозданиеДвиженийПоНДФЛ(Дата) Тогда 
		Возврат Сумма - СуммаНДФЛ;
	Иначе
		Возврат Сумма;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура УстановитьВариантыНазначенияПлатежа(УстановитьПоУмолчанию = Ложь)
	
	ВидДДУ			= Объект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления;
	НаименованиеДДУ	= Объект.СчетДоверительногоУправления.Наименование;
	НомерДДУ		= Объект.СчетДоверительногоУправления.НомерДоговора;
	ДатаДДУ			= Формат(Объект.СчетДоверительногоУправления.ДатаЗаключения, "ДФ='дд.ММ.гггг ''г.'''");
	
	СписокВыбора = Новый Массив;
	
	Если ВидДДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
		СписокВыбора.Добавить("Возврат денежных средств. Без НДС.");
	Иначе	
		СписокВыбора.Добавить("Возврат денежных средств по договору ДУ № " + НомерДДУ + " от " + ДатаДДУ + ". Без НДС.");
	КонецЕсли;
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		ПостфиксЗаявки	= Строка(Объект.Основание.ВидЗаявки);
		НомерЗаявки		= Объект.Основание.НомерЗаявки;
		ДатаЗаявки		= Формат(Объект.Основание.Дата, "ДФ='дд.ММ.гггг ''г.'''");
		
		СписокВыбора.Добавить("Компенсация за паи " + НаименованиеДДУ + " Заявка " + НомерЗаявки + " от " + ДатаЗаявки + " Без НДС.");
		СписокВыбора.Добавить("Компенсация за паи " + НаименованиеДДУ + " Заявка " + НомерЗаявки + " от " + ДатаЗаявки + " в счет оплаты за паи ___ (___), заявка №___ от ___ г. Без НДС.");
		СписокВыбора.Добавить("Для зачисления на л/с, компенсация за паи " + НаименованиеДДУ + " Заявка " + НомерЗаявки + " от " + ДатаЗаявки + " Без НДС.");
	КонецЕсли;
	
	Элементы.НазначениеПлатежа.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	
	Если УстановитьПоУмолчанию Тогда
		Объект.НазначениеПлатежа = СписокВыбора[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
	
	ВидыДоговоровДоверительногоУправления	= РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыДоговоровДоверительногоУправления");
	ВидДоговораДоверительногоУправления		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	
	БезналичнаяФормаДенежныхСредств = (ДанныеОбъекта.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная"));
	                                                                                                                      
	ОтПайщика = (ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику")
					или ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ"));
	
	Элементы.Основание.АвтоОтметкаНезаполненного = ОтПайщика;
	Элементы.ГруппаСуммаНДФЛ.Видимость           = ОтПайщика;
	
	Если ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику")
		Или ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствПриОбменеПаев") Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументСсылка.ЗаявкаПайщика"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ПогашениеПаев"));
		Элементы.Основание.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	ИначеЕсли ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ") Тогда
		Элементы.Основание.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПогашениеПаев");
	Иначе
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ПоручениеНаДвижениеЦенныхБумаг"));
		
		Элементы.Основание.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		
	КонецЕсли;
	Элементы.Основание.ПодсказкаВвода = Строка(Элементы.Основание.ОграничениеТипа);
	
	Элементы.ГруппаБезналичныеДенежныеСредства.Видимость = БезналичнаяФормаДенежныхСредств;
	Элементы.РасчетныйСчетКонтрагента.Видимость          = БезналичнаяФормаДенежныхСредств;
	Элементы.СтрокаБанковскойВыписки.Видимость           = БезналичнаяФормаДенежныхСредств;
	Если НЕ РаботаСДокументамиКлиентСервер.ТребуетсяСозданиеДвиженийПоНДФЛ(ДанныеОбъекта.Дата) Тогда    
		Элементы.СтрокаБанковскойВыпискиНДФЛ.Видимость = Ложь;
		Элементы.РассчитатьНДФЛ.Видимость = Ложь;
	Иначе	
		Элементы.СтрокаБанковскойВыпискиНДФЛ.Видимость   = БезналичнаяФормаДенежныхСредств;
	КонецЕсли;
	
	ТребуетсяПроверкаЗаполненияКонтрагента = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
		
	Элементы.КонтрагентДоговорТекстом.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного			= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.РасчетныйСчетКонтрагента.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.Контрагент.АвтоОтметкаНезаполненного               = ТребуетсяПроверкаЗаполненияКонтрагента;
	
	СобственныйСчетДУ = (ВидДоговораДоверительногоУправления = ВидыДоговоровДоверительногоУправления.Собственный);

	Элементы.ТипПередачи.Видимость = Не СобственныйСчетДУ;
	Элементы.Контрагент.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	
	Элементы.КомандаВыбратьДанныеПоКонтрагенту.Доступность 				= Не Форма.ТолькоПросмотр;
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Доступность 	= Не Форма.ТолькоПросмотр;
	
	Элементы.Касса.Видимость = (ДанныеОбъекта.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная"));
	
	Элементы.ДокументЗачисления.Видимость = (ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратОшибочноЗачисленных"));
	
	Элементы.ГруппаНДФЛ.Видимость = (ВидДоговораДоверительногоУправления = ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
	
	Элементы.ДекорацияАкцептовано.Видимость	= ЗначениеЗаполнено(ДанныеОбъекта.СтрокаБанковскойВыписки) 
			И РаботаСДокументами.ДокументАкцептован(ДанныеОбъекта.СтрокаБанковскойВыписки, ДанныеОбъекта.Организация);
			
КонецПроцедуры //НастроитьВидимостьДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1",
		"Субконто2",
		"Субконто3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.СтрокаБанковскойВыписки     = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	ЭтаФорма.СтрокаБанковскойВыпискиНДФЛ = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыпискиНДФЛ);
			
	Если ЗначениеЗаполнено(Объект.ВидОперации) и НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Объект.КоррСчет) Тогда
			Объект.КоррСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ВидОперации);	
		КонецЕсли;
		ЗаполнитьСубконто1НаСервере();
	КонецЕсли; 

	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
		
	КонецЕсли;

	НастроитьПараметрыОтбораОснования();		
	УстановитьВариантыНазначенияПлатежа();
	
	НастроитьВидимостьИДоступность(ЭтаФорма); 
	
	ЭтаФорма.СуммаПайщику = РассчитатьСуммуПайщику(Объект.Сумма, Объект.СуммаНДФЛ, Объект.Дата);
		
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеПоручениеНаСервере()
	
	Поручение = Объект.Основание.ПолучитьОбъект();
		
	НачатьТранзакцию();
	
	Попытка
		Объект.Основание = Неопределено;
		Поручение.УстановитьПометкуУдаления(Истина);
		Поручение.Записать();
		
		Если Объект.Проведен Тогда
			ЭтаФорма.ПриЗаписиПерепроводить = Истина;
		Иначе	
			ЭтаФорма.ПриЗаписиПерепроводить = Ложь;
		КонецЕсли;
		
		Если ЭтаФорма.Записать() Тогда
			ЗафиксироватьТранзакцию();		
		КонецЕсли;	
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось пометить на удаление поручение " + Объект.Основание + "!" + ОписаниеОшибки(),,,,);
		
	КонецПопытки;
		
КонецПроцедуры	

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыОтбораОснования()
	
	МассивПараметровВыбора = Новый Массив;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДенежныхСредствПриОбменеПаев") Тогда
		
		КлиентУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
		
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПаевойИнвестиционныйФонд", КлиентУправления));
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ") Тогда			
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВариантПогашенияПаев", Перечисления.ВариантыПогашенияПаев.ПриЗакрытииПИФ));
		КонецЕсли;
		
	Иначе
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.СчетДоверительногоУправления", Объект.СчетДоверительногоУправления));
	КонецЕсли;

	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
	
	Элементы.Основание.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстКонтрагентаДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если ЗначениеЗаполнено(Объект.КонтрагентДоговорТекстом) Тогда
			Объект.КонтрагентДоговорТекстом = "";
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	Объект.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(											
											Объект.Организация, 
											Объект.Контрагент,											
											Объект.РасчетныйСчетКонтрагента, 
											ЭтаФорма.ТипПередачи = 1, 
											Объект.Дата);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасчетныйСчетПриИзмененииКонтрагента()
	
	Если Не ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		Объект.РасчетныйСчетКонтрагента = "";
		Объект.КонтрагентДоговорТекстом = "";
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "ЮрФизЛицо") <> Объект.Контрагент Тогда
		Объект.РасчетныйСчетКонтрагента = "";
		Объект.КонтрагентДоговорТекстом = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
